
# 1. Создать две переменные a=10, b=30. Вывести на экран результат математического
# взаимодействия (+, -, *, / ) этих чисел.

a = 10
print(a)
b = 30
print(b)
c = a + b
print(c)
c = a - b
print(c)
c = a * b
print(c)
c = a / b
print(c)

# 2. Создать переменную и поочередно записать в нее результат сравнения (<, > , ==, !=) чисел
# из задания 1. После этого вывести на экран значение каждой полученной переменной.

my_bool_t = True
my_bool_f = False

my_bool = a < b # True
print(my_bool)
my_bool = a > b # False
print(my_bool)
my_bool = a == b # False
print(my_bool)
my_bool = a != b # True
print(my_bool)

# 3. *Создать переменную - результат конкатенации (сложения) строк str1="Hello " и str2="world". Вывести на ее экран.

my_str1 = "Hello "
my_str2 = "world"

res = my_str1 + my_str2
print(res)

#  Что вы видиье для себя результатом курса?
# Сменить сферу деятельности, изучить Python
#  Как собираетесь использовать этот результат?
#  найти работу
#  Чем готовы пожертвовать ради достижения результата?
# личным временем
